## Terraform plan (envs/dev)\n\n<details>\n<summary>Plan summary</summary>\n\n<pre>\ncreate:  51\nupdate:  0\ndelete:  0\nreplace: 0\nread:    3\nno_op:   0\n</pre>\n</details>\n\n<details>\n<summary>Full plan (truncated)</summary>\n\n<pre>
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 &lt;= read (data resources)

Terraform will perform the following actions:

  # aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-03-01-26-02-nat-eip"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all             = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-03-01-26-02-nat-eip"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + vpc                  = (known after apply)
    }

  # aws_eks_access_entry.terraform_admin will be created
  + resource "aws_eks_access_entry" "terraform_admin" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "goldenpath-dev-eks-03-01-26-02"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:sts::593517239005:assumed-role/teffaorm_plan_read_only/GitHubActions"
      + tags              = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all          = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.terraform_admin will be created
  + resource "aws_eks_access_policy_association" "terraform_admin" {
      + associated_at = (known after apply)
      + cluster_name  = "goldenpath-dev-eks-03-01-26-02"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:sts::593517239005:assumed-role/teffaorm_plan_read_only/GitHubActions"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_nat_gateway.this will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-03-01-26-02-nat"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                           = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-03-01-26-02-nat"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # kubernetes_service_account_v1.aws_load_balancer_controller[0] will be created
  + resource "kubernetes_service_account_v1" "aws_load_balancer_controller" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "aws-load-balancer-controller"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account_v1.cluster_autoscaler[0] will be created
  + resource "kubernetes_service_account_v1" "cluster_autoscaler" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "cluster-autoscaler"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.compute[0].aws_instance.app will be created
  + resource "aws_instance" "app" {
      + ami                                  = "ami-0a0ff88d0f3f85a14"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-app"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                             = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-app"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface {
          + delete_on_termination = false
          + device_index          = 0
          + network_card_index    = 0
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = "gp3"
        }
    }

  # module.compute[0].aws_network_interface.instance will be created
  + resource "aws_network_interface" "instance" {
      + arn                       = (known after apply)
      + description               = "Golden Path dev instance"
      + enable_primary_ipv6       = (known after apply)
      + id                        = (known after apply)
      + interface_type            = (known after apply)
      + ipv4_prefix_count         = (known after apply)
      + ipv4_prefixes             = (known after apply)
      + ipv6_address_count        = (known after apply)
      + ipv6_address_list         = (known after apply)
      + ipv6_address_list_enabled = false
      + ipv6_addresses            = (known after apply)
      + ipv6_prefix_count         = (known after apply)
      + ipv6_prefixes             = (known after apply)
      + mac_address               = (known after apply)
      + outpost_arn               = (known after apply)
      + owner_id                  = (known after apply)
      + private_dns_name          = (known after apply)
      + private_ip                = (known after apply)
      + private_ip_list           = (known after apply)
      + private_ip_list_enabled   = false
      + private_ips               = (known after apply)
      + private_ips_count         = (known after apply)
      + security_groups           = (known after apply)
      + source_dest_check         = true
      + subnet_id                 = (known after apply)
      + tags                      = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-app-eni"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                  = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-app-eni"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }

      + attachment (known after apply)
    }

  # module.eks[0].data.tls_certificate.oidc will be read during apply
  # (config refers to values not yet known)
 &lt;= data "tls_certificate" "oidc" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks[0].aws_eks_addon.coredns will be created
  + resource "aws_eks_addon" "coredns" {
      + addon_name                  = "coredns"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "goldenpath-dev-eks-03-01-26-02"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-03-01-26-02-coredns"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                    = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-03-01-26-02-coredns"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # module.eks[0].aws_eks_addon.ebs_csi_driver[0] will be created
  + resource "aws_eks_addon" "ebs_csi_driver" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "goldenpath-dev-eks-03-01-26-02"
      + configuration_values        = jsonencode(
            {
              + controller = {
                  + replicaCount = 1
                }
            }
        )
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-03-01-26-02-aws-ebs-csi-driver"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                    = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-03-01-26-02-aws-ebs-csi-driver"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # module.eks[0].aws_eks_addon.efs_csi_driver[0] will be created
  + resource "aws_eks_addon" "efs_csi_driver" {
      + addon_name                  = "aws-efs-csi-driver"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "goldenpath-dev-eks-03-01-26-02"
      + configuration_values        = jsonencode(
            {
              + controller = {
                  + replicaCount = 1
                }
            }
        )
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-03-01-26-02-aws-efs-csi-driver"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                    = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-03-01-26-02-aws-efs-csi-driver"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # module.eks[0].aws_eks_addon.kube_proxy will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name                  = "kube-proxy"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "goldenpath-dev-eks-03-01-26-02"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-03-01-26-02-kube-proxy"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                    = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-03-01-26-02-kube-proxy"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # module.eks[0].aws_eks_addon.snapshot_controller[0] will be created
  + resource "aws_eks_addon" "snapshot_controller" {
      + addon_name                  = "snapshot-controller"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "goldenpath-dev-eks-03-01-26-02"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-03-01-26-02-snapshot-controller"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                    = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-03-01-26-02-snapshot-controller"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # module.eks[0].aws_eks_addon.vpc_cni will be created
  + resource "aws_eks_addon" "vpc_cni" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "goldenpath-dev-eks-03-01-26-02"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-03-01-26-02-vpc-cni"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                    = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-03-01-26-02-vpc-cni"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # module.eks[0].aws_eks_cluster.this will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "goldenpath-dev-eks-03-01-26-02"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                      = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + version                       = "1.29"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = true
        }

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks[0].aws_eks_node_group.this will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "goldenpath-dev-eks-03-01-26-02"
      + disk_size              = 20
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "dev-default"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "BuildId"                                                  = "03-01-26-02"
          + "Environment"                                              = "dev"
          + "Lifecycle"                                                = "ephemeral"
          + "ManagedBy"                                                = "terraform"
          + "Owner"                                                    = "platform-team"
          + "Project"                                                  = "goldenpath-idp"
          + "k8s.io/cluster-autoscaler/enabled"                        = "true"
          + "k8s.io/cluster-autoscaler/goldenpath-dev-eks-03-01-26-02" = "owned"
        }
      + tags_all               = {
          + "BuildId"                                                  = "03-01-26-02"
          + "Environment"                                              = "dev"
          + "Lifecycle"                                                = "ephemeral"
          + "ManagedBy"                                                = "terraform"
          + "Owner"                                                    = "platform-team"
          + "Project"                                                  = "goldenpath-idp"
          + "k8s.io/cluster-autoscaler/enabled"                        = "true"
          + "k8s.io/cluster-autoscaler/goldenpath-dev-eks-03-01-26-02" = "owned"
        }
      + version                = (known after apply)

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 4
          + max_size     = 7
          + min_size     = 4
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks[0].aws_iam_openid_connect_provider.this will be created
  + resource "aws_iam_openid_connect_provider" "this" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-03-01-26-02-oidc-provider"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all        = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-03-01-26-02-oidc-provider"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks[0].aws_iam_role.cluster will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-dev-eks-03-01-26-02-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-03-01-26-02-cluster-role"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-03-01-26-02-cluster-role"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks[0].aws_iam_role.node_group will be created
  + resource "aws_iam_role" "node_group" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-dev-eks-03-01-26-02-node-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-03-01-26-02-node-role"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-03-01-26-02-node-role"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks[0].aws_iam_role_policy_attachment.cluster["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "cluster" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "goldenpath-dev-eks-03-01-26-02-cluster-role"
    }

  # module.eks[0].aws_iam_role_policy_attachment.cluster["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "cluster" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "goldenpath-dev-eks-03-01-26-02-cluster-role"
    }

  # module.eks[0].aws_iam_role_policy_attachment.node_group["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "node_group" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "goldenpath-dev-eks-03-01-26-02-node-role"
    }

  # module.eks[0].aws_iam_role_policy_attachment.node_group["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "node_group" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "goldenpath-dev-eks-03-01-26-02-node-role"
    }

  # module.eks[0].aws_iam_role_policy_attachment.node_group["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "node_group" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "goldenpath-dev-eks-03-01-26-02-node-role"
    }

  # module.eks[0].aws_iam_role_policy_attachment.node_group["arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "node_group" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
      + role       = "goldenpath-dev-eks-03-01-26-02-node-role"
    }

  # module.eks[0].aws_security_group.cluster will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS cluster control plane"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "goldenpath-dev-eks-03-01-26-02-cluster-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-03-01-26-02-cluster-sg"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all               = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-03-01-26-02-cluster-sg"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + vpc_id                 = (known after apply)
    }

  # module.iam[0].data.aws_iam_policy_document.cluster_autoscaler_assume[0] will be read during apply
  # (config refers to values not yet known)
 &lt;= data "aws_iam_policy_document" "cluster_autoscaler_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:cluster-autoscaler",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam[0].data.aws_iam_policy_document.lb_controller_assume[0] will be read during apply
  # (config refers to values not yet known)
 &lt;= data "aws_iam_policy_document" "lb_controller_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam[0].aws_iam_role.cluster_autoscaler[0] will be created
  + resource "aws_iam_role" "cluster_autoscaler" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-idp-cluster-autoscaler-03-01-26-02"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam[0].aws_iam_role.eks_cluster will be created
  + resource "aws_iam_role" "eks_cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-dev-eks-cluster-role-03-01-26-02"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam[0].aws_iam_role.eks_node_group will be created
  + resource "aws_iam_role" "eks_node_group" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-dev-eks-node-role-03-01-26-02"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam[0].aws_iam_role.lb_controller[0] will be created
  + resource "aws_iam_role" "lb_controller" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-idp-aws-load-balancer-controller-03-01-26-02"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "03-01-26-02"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam[0].aws_iam_role_policy_attachment.cluster_autoscaler[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_autoscaler" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::593517239005:policy/golden-path-cluster-autoscaler-policy"
      + role       = "goldenpath-idp-cluster-autoscaler-03-01-26-02"
    }

  # module.iam[0].aws_iam_role_policy_attachment.eks_cluster_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "goldenpath-dev-eks-cluster-role-03-01-26-02"
    }

  # module.iam[0].aws_iam_role_policy_attachment.eks_vpc_resource_controller will be created
  + resource "aws_iam_role_policy_attachment" "eks_vpc_resource_controller" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "goldenpath-dev-eks-cluster-role-03-01-26-02"
    }

  # module.iam[0].aws_iam_role_policy_attachment.lb_controller[0] will be created
  + resource "aws_iam_role_policy_attachment" "lb_controller" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::593517239005:policy/goldenpath-load-balancer-controller-policy"
      + role       = "goldenpath-idp-aws-load-balancer-controller-03-01-26-02"
    }

  # module.kubernetes_addons[0].helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + verify                     = false
      + version                    = "5.46.7"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "server.service.type"
          + value = "ClusterIP"
            # (1 unchanged attribute hidden)
        }
    }

  # module.kubernetes_addons[0].helm_release.aws_load_balancer_controller will be created
  + resource "helm_release" "aws_load_balancer_controller" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.17.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "goldenpath-dev-eks-03-01-26-02"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "region"
          + value = "eu-west-2"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "vpcId"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.kubernetes_addons[0].helm_release.bootstrap_apps will be created
  + resource "helm_release" "bootstrap_apps" {
      + atomic                     = false
      + chart                      = "../../modules/kubernetes_addons/bootstrap-chart"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "bootstrap-apps"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + &lt;&lt;-EOT
                "manifests":
                - |
                  # Managed by scripts/standardize-metadata.py
                  apiVersion: argoproj.io/v1alpha1
                  kind: Application
                  metadata:
                    name: dev-backstage
                    namespace: argocd
                    annotations:
                      goldenpath.idp/id: HELM_BACKSTAGE
                      goldenpath.idp/owner: platform-team
                      goldenpath.idp/risk: medium
                  spec:
                    project: default
                    destination:
                      namespace: backstage
                      server: https://kubernetes.default.svc
                    sources:
                      - repoURL: https://backstage.github.io/charts
                        chart: backstage
                        targetRevision: 1.12.0
                        helm:
                          valueFiles:
                            - $values/gitops/helm/backstage/values/dev.yaml
                      - repoURL: https://github.com/mikeybeezy/goldenpath-idp-infra.git
                        targetRevision: HEAD
                        ref: values
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                        - CreateNamespace=true
                - |
                  # Managed by scripts/standardize-metadata.py
                  apiVersion: argoproj.io/v1alpha1
                  kind: Application
                  metadata:
                    name: dev-cert-manager
                    namespace: argocd
                    annotations:
                      goldenpath.idp/id: HELM_CERT_MANAGER
                      goldenpath.idp/owner: platform-team
                      goldenpath.idp/risk: medium
                  spec:
                    project: default
                    destination:
                      namespace: cert-manager
                      server: https://kubernetes.default.svc
                    sources:
                      - repoURL: https://charts.jetstack.io
                        chart: cert-manager
                        targetRevision: v1.14.4
                        helm:
                          valueFiles:
                            - $values/gitops/helm/cert-manager/values/dev.yaml
                      - repoURL: https://github.com/mikeybeezy/goldenpath-idp-infra.git
                        targetRevision: HEAD
                        ref: values
                    ignoreDifferences:
                      - group: admissionregistration.k8s.io
                        kind: ValidatingWebhookConfiguration
                        jqPathExpressions:
                          - .webhooks[].clientConfig.caBundle
                      - group: admissionregistration.k8s.io
                        kind: MutatingWebhookConfiguration
                        jqPathExpressions:
                          - .webhooks[].clientConfig.caBundle
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                        - CreateNamespace=true
                - |
                  # Managed by scripts/standardize-metadata.py
                  apiVersion: argoproj.io/v1alpha1
                  kind: Application
                  metadata:
                    name: dev-cluster-autoscaler
                    namespace: argocd
                    annotations:
                      goldenpath.idp/id: HELM_CLUSTER_AUTOSCALER
                      goldenpath.idp/owner: platform-team
                      goldenpath.idp/risk: low
                  spec:
                    project: default
                    destination:
                      namespace: kube-system
                      server: https://kubernetes.default.svc
                    sources:
                      - repoURL: https://kubernetes.github.io/autoscaler
                        chart: cluster-autoscaler
                        targetRevision: 9.43.0
                        helm:
                          valueFiles:
                            - $values/gitops/helm/cluster-autoscaler/values/dev.yaml
                      - repoURL: https://github.com/mikeybeezy/goldenpath-idp-infra.git
                        targetRevision: HEAD
                        ref: values
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                        - CreateNamespace=true
                - |
                  # Managed by scripts/standardize-metadata.py
                  apiVersion: argoproj.io/v1alpha1
                  kind: Application
                  metadata:
                    name: dev-datree
                    namespace: argocd
                    annotations:
                      goldenpath.idp/id: HELM_DATREE
                      goldenpath.idp/owner: platform-team
                      goldenpath.idp/risk: low
                  spec:
                    project: default
                    destination:
                      namespace: datree-system
                      server: https://kubernetes.default.svc
                    sources:
                      - repoURL: https://charts.datree.io
                        chart: datree-admission-webhook
                        targetRevision: 1.0.12
                        helm:
                          valueFiles:
                            - $values/gitops/helm/datree/values/dev.yaml
                      - repoURL: https://github.com/mikeybeezy/goldenpath-idp-infra.git
                        targetRevision: HEAD
                        ref: values
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                        - CreateNamespace=true
                - |
                  # Managed by scripts/standardize-metadata.py
                  apiVersion: argoproj.io/v1alpha1
                  kind: Application
                  metadata:
                    name: dev-external-secrets
                    namespace: argocd
                    annotations:
                      goldenpath.idp/id: HELM_EXTERNAL_SECRETS
                      goldenpath.idp/owner: platform-team
                      goldenpath.idp/risk: low
                  spec:
                    project: default
                    destination:
                      namespace: external-secrets
                      server: https://kubernetes.default.svc
                    sources:
                      - repoURL: https://charts.external-secrets.io
                        chart: external-secrets
                        targetRevision: 0.9.13
                        helm:
                          valueFiles:
                            - $values/gitops/helm/external-secrets/values/dev.yaml
                      - repoURL: https://github.com/mikeybeezy/goldenpath-idp-infra.git
                        targetRevision: HEAD
                        ref: values
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                        - CreateNamespace=true
                - |
                  # Managed by scripts/standardize-metadata.py
                  apiVersion: argoproj.io/v1alpha1
                  kind: Application
                  metadata:
                    name: dev-fluent-bit
                    namespace: argocd
                    annotations:
                      goldenpath.idp/id: HELM_FLUENT_BIT
                      goldenpath.idp/owner: platform-team
                      goldenpath.idp/risk: low
                  spec:
                    project: default
                    destination:
                      namespace: monitoring
                      server: https://kubernetes.default.svc
                    sources:
                      - repoURL: https://fluent.github.io/helm-charts
                        chart: fluent-bit
                        targetRevision: 0.47.0
                        helm:
                          valueFiles:
                            - $values/gitops/helm/fluent-bit/values/dev.yaml
                      - repoURL: https://github.com/mikeybeezy/goldenpath-idp-infra.git
                        targetRevision: HEAD
                        ref: values
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                        - CreateNamespace=true
                - |
                  # Managed by scripts/standardize-metadata.py
                  apiVersion: argoproj.io/v1alpha1
                  kind: Application
                  metadata:
                    name: dev-keycloak
                    namespace: argocd
                    annotations:
                      goldenpath.idp/id: TOOL_KEYCLOAK
                      goldenpath.idp/owner: platform-team
                      goldenpath.idp/risk: high
                  spec:
                    project: default
                    destination:
                      namespace: keycloak
                      server: https://kubernetes.default.svc
                    sources:
                      - repoURL: https://charts.bitnami.com/bitnami
                        chart: keycloak
                        targetRevision: 22.1.6
                        helm:
                          valueFiles:
                            - $values/gitops/helm/keycloak/values/dev.yaml
                      - repoURL: https://github.com/mikeybeezy/goldenpath-idp-infra.git
                        targetRevision: HEAD
                        ref: values
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                        - CreateNamespace=true
                - |
                  # Managed by scripts/standardize-metadata.py
                  apiVersion: argoproj.io/v1alpha1
                  kind: Application
                  metadata:
                    name: dev-kong
                    namespace: argocd
                    annotations:
                      goldenpath.idp/id: TOOL_KONG
                      goldenpath.idp/owner: platform-team
                      goldenpath.idp/risk: high
                  spec:
                    project: default
                    destination:
                      namespace: kong-system
                      server: https://kubernetes.default.svc
                    sources:
                      - repoURL: https://charts.konghq.com
                        chart: kong
                        targetRevision: 2.47.0
                        helm:
                          valueFiles:
                            - $values/gitops/helm/kong/values/dev.yaml
                      - repoURL: https://github.com/mikeybeezy/goldenpath-idp-infra.git
                        targetRevision: HEAD
                        ref: values
                    ignoreDifferences:
                      - group: admissionregistration.k8s.io
                        kind: ValidatingWebhookConfiguration
                        jqPathExpressions:
                          - .webhooks[].clientConfig.caBundle
                      - group: admissionregistration.k8s.io
                        kind: MutatingWebhookConfiguration
                        jqPathExpressions:
                          - .webhooks[].clientConfig.caBundle
                      - group: ''
                        kind: Secret
                        name: dev-kong-kong-validation-webhook-ca-keypair
                        namespace: kong-system
                        jsonPointers:
                          - /data
                      - group: ''
                        kind: Secret
                        name: dev-kong-kong-validation-webhook-keypair
                        namespace: kong-system
                        jsonPointers:
                          - /data
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                        - CreateNamespace=true
                - |
                  # Managed by scripts/standardize-metadata.py
                  apiVersion: argoproj.io/v1alpha1
                  kind: Application
                  metadata:
                    name: dev-kube-prometheus-stack
                    namespace: argocd
                    annotations:
                      goldenpath.idp/id: HELM_PROMETHEUS
                      goldenpath.idp/owner: platform-team
                      goldenpath.idp/risk: low
                  spec:
                    project: default
                    destination:
                      namespace: monitoring
                      server: https://kubernetes.default.svc
                    sources:
                      - repoURL: https://prometheus-community.github.io/helm-charts
                        chart: kube-prometheus-stack
                        targetRevision: 45.7.1
                        helm:
                          valueFiles:
                            - $values/gitops/helm/kube-prometheus-stack/values/dev.yaml
                      - repoURL: https://github.com/mikeybeezy/goldenpath-idp-infra.git
                        targetRevision: HEAD
                        ref: values
                    syncPolicy:
                      automated</pre>\n</details>\n\n_Truncated to 65k characters._